In [1]:
import pandas as pd
from nltk.stem import SnowballStemmer
from pymystem3 import Mystem
m = Mystem()
from collections import Counter

In [2]:
data = pd.read_csv('/datasets/data.csv')

In [3]:
data.head(10)

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
0,1,-8437.673028,42,высшее,0,женат / замужем,0,F,сотрудник,0,253875.639453,покупка жилья
1,1,-4024.803754,36,среднее,1,женат / замужем,0,F,сотрудник,0,112080.014102,приобретение автомобиля
2,0,-5623.422610,33,Среднее,1,женат / замужем,0,M,сотрудник,0,145885.952297,покупка жилья
3,3,-4124.747207,32,среднее,1,женат / замужем,0,M,сотрудник,0,267628.550329,дополнительное образование
4,0,340266.072047,53,среднее,1,гражданский брак,1,F,пенсионер,0,158616.077870,сыграть свадьбу
5,0,-926.185831,27,высшее,0,гражданский брак,1,M,компаньон,0,255763.565419,покупка жилья
6,0,-2879.202052,43,высшее,0,женат / замужем,0,F,компаньон,0,240525.971920,операции с жильем
7,0,-152.779569,50,СРЕДНЕЕ,1,женат / замужем,0,M,сотрудник,0,135823.934197,образование
8,2,-6929.865299,35,ВЫСШЕЕ,0,гражданский брак,1,F,сотрудник,0,95856.832424,на проведение свадьбы
9,0,-2188.756445,41,среднее,1,женат / замужем,0,M,сотрудник,0,144425.938277,покупка жилья для семьи

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
children            21525 non-null int64
days_employed       19351 non-null float64
dob_years           21525 non-null int64
education           21525 non-null object
education_id        21525 non-null int64
family_status       21525 non-null object
family_status_id    21525 non-null int64
gender              21525 non-null object
income_type         21525 non-null object
debt                21525 non-null int64
total_income        19351 non-null float64
purpose             21525 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB

В представленных данных у нас 12 разных характеристик.  8 категориальных и 4 количественных. Две пары характеристик - повторяются(education и family status).
По необходимым действиям:
Видны пропуски в day_employed и total_income(необходимы определить, в чем дело.)
Необходимо понять структуру данных в day_employed(почему отрицательные значения)
Проверить есть ли нулевые значения в столбцах.
Сгруппировать людей по возрастам(в будущем возможно будет разная статистика по возвращению кредитов в разных возрастных группах)
Проверить все характеристики на наличие дубликатов.

In [5]:
data['children'].value_counts()

 0     14149
 1      4818
 2      2055
 3       330
 20       76
-1        47
 4        41
 5         9
Name: children, dtype: int64

В характеристики дети появились странные значения. -1 и 20.
-1 думаю человек имел ввиду 1 ребенок. Указал -(дефис) 1. 
20 опечатка, но понять, что имел человек тут невозможно(2 или 0)
Количество строк с этими значениями незначительно. На общую картину влиять не будет. Удаляем.

In [6]:
data = data[(data['children'] != -1) & (data['children'] != 43) & (data['children'] != 20)]

In [7]:
data['children'].value_counts()

0    14149
1     4818
2     2055
3      330
4       41
5        9
Name: children, dtype: int64

Переходим к возрасту

In [8]:
data['dob_years'].value_counts()

35    614
40    603
41    603
34    597
38    595
42    592
33    577
39    572
31    556
36    553
29    543
44    543
30    536
48    536
37    531
43    510
50    509
32    506
49    505
28    501
45    494
27    490
52    483
56    482
47    480
54    476
46    469
58    461
57    457
53    457
51    446
55    441
59    441
26    406
60    376
25    356
61    353
62    351
63    268
64    263
24    263
23    252
65    194
66    183
22    183
67    167
21    110
0     100
68     99
69     83
70     65
71     58
20     51
72     33
19     14
73      8
74      6
75      1
Name: dob_years, dtype: int64

Среди возрастов затесались люди с 0 годов жизни. Это явный пропуск. Вычисляем среднее значение и подставляем вместо 0.

In [9]:
data['dob_years'].mean()

43.30020558826278

In [10]:
data.loc[data['dob_years'] == 0, 'dob_years'] = 43

In [11]:
data['dob_years'].value_counts()

35    614
43    610
40    603
41    603
34    597
38    595
42    592
33    577
39    572
31    556
36    553
29    543
44    543
30    536
48    536
37    531
50    509
32    506
49    505
28    501
45    494
27    490
52    483
56    482
47    480
54    476
46    469
58    461
53    457
57    457
51    446
55    441
59    441
26    406
60    376
25    356
61    353
62    351
63    268
64    263
24    263
23    252
65    194
66    183
22    183
67    167
21    110
68     99
69     83
70     65
71     58
20     51
72     33
19     14
73      8
74      6
75      1
Name: dob_years, dtype: int64

0 заменен на среднее значение по возрасту. 43

Переходим к образованию.

In [12]:
data['education'].value_counts()

среднее                13667
высшее                  4698
СРЕДНЕЕ                  766
Среднее                  703
неоконченное высшее      665
ВЫСШЕЕ                   271
Высшее                   268
начальное                250
Неоконченное высшее       47
НЕОКОНЧЕННОЕ ВЫСШЕЕ       29
НАЧАЛЬНОЕ                 17
Начальное                 15
ученая степень             4
УЧЕНАЯ СТЕПЕНЬ             1
Ученая степень             1
Name: education, dtype: int64

In [13]:
data['education_id'].value_counts()

1    15136
0     5237
2      741
3      282
4        6
Name: education_id, dtype: int64

In [14]:
data.groupby('education_id')['education'].value_counts()

education_id  education
0             высшее                  4698
              ВЫСШЕЕ                   271
              Высшее                   268
1             среднее                13667
              СРЕДНЕЕ                  766
              Среднее                  703
2             неоконченное высшее      665
              Неоконченное высшее       47
              НЕОКОНЧЕННОЕ ВЫСШЕЕ       29
3             начальное                250
              НАЧАЛЬНОЕ                 17
              Начальное                 15
4             ученая степень             4
              УЧЕНАЯ СТЕПЕНЬ             1
              Ученая степень             1
Name: education, dtype: int64

Так как эти характеристику коррелируют, в столбце education можно не обрабатывать значения(менять регистр на нижний, приводить к одному значению). 
Характеристика education_id без пропусков показывает необходимые значения:
<br>0 - высшее</br>
<br>1 - среднее</br>
<br>2 - неоконченное высшее</br>
<br>3 - начальное </br>
<br>4 - ученая степень</br>

Необходимо свести все к одному регистру.

In [15]:
data['education'] = data['education'].str.lower()

In [16]:
data['education'].value_counts()

среднее                15136
высшее                  5237
неоконченное высшее      741
начальное                282
ученая степень             6
Name: education, dtype: int64

Переходим к family

In [17]:
data['family_status'].value_counts()

женат / замужем          12302
гражданский брак          4160
Не женат / не замужем     2799
в разводе                 1189
вдовец / вдова             952
Name: family_status, dtype: int64

In [18]:
data['family_status_id'].value_counts()

0    12302
1     4160
4     2799
3     1189
2      952
Name: family_status_id, dtype: int64

In [19]:
data.groupby('family_status_id')['family_status'].value_counts()

family_status_id  family_status
0                 женат / замужем          12302
1                 гражданский брак          4160
2                 вдовец / вдова             952
3                 в разводе                 1189
4                 Не женат / не замужем     2799
Name: family_status, dtype: int64

Ситуация аналогичная с education. Обе характеристики коррелируют. Можно использовать характеристику family_status_id:
<br> 0 - женат</br>
<br> 1 - гражд. брак</br>
<br> 2 - вдовец </br>
<br> 3 - развод </br>
<br> 4 - не женат  </br>

Так как решаю не использовать 2 характеристики, так как они дублируются - убираю их из таблицы, чтобы в будущем они не мешали в работе.

Проверяем пол

In [20]:
data['gender'].value_counts()

F      14154
M       7247
XNA        1
Name: gender, dtype: int64

Появилось странное значение XNA. гугл не объяснил, что это. Убираем из таблицы.

In [21]:
data = data[data['gender'] != 'XNA']

In [22]:
data['gender'].value_counts()

F    14154
M     7247
Name: gender, dtype: int64

переходим к источнику

In [23]:
data['income_type'].value_counts()

сотрудник          11050
компаньон           5053
пенсионер           3839
госслужащий         1453
предприниматель        2
безработный            2
студент                1
в декрете              1
Name: income_type, dtype: int64

Не представляю, что сотрудники банка подразумевали под словом компаньон. По мне предприниматель и компаньон это одно и тоже. Безработный, студент и в декрете думаю сразу красных флаг для кредитного скоринга.
<br>Есть несколько вариантов. Первый: распределить маленькие значения по другим столбцам. Второй: убрать их, так как они являют собой малый процент от общих данных.</br>
<br> Я считаю, что нужно предпринимателя отправить к компаньонам. студент, безработный и в декрете объеденить в одно. безработный. Возможно в будущем анализе, факт безработности будет важен.

In [24]:
data['income_type'] = data['income_type'].replace('предприниматель', 'компаньон')

In [25]:
data['income_type'] = data['income_type'].replace('в декрете', 'безработный')
data['income_type'] = data['income_type'].replace('студент', 'безработный')

In [26]:
data['income_type'].value_counts()

сотрудник      11050
компаньон       5055
пенсионер       3839
госслужащий     1453
безработный        4
Name: income_type, dtype: int64

In [27]:
data['debt'].value_counts()

0    19669
1     1732
Name: debt, dtype: int64

Характеристика, которая указывает были ли проблемы с возвратом кредита у записанных в таблицу.

In [28]:
data[data['total_income'].isna()]

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
12,0,NaN,65,среднее,1,гражданский брак,1,M,пенсионер,0,NaN,сыграть свадьбу
26,0,NaN,41,среднее,1,женат / замужем,0,M,госслужащий,0,NaN,образование
29,0,NaN,63,среднее,1,Не женат / не замужем,4,F,пенсионер,0,NaN,строительство жилой недвижимости
41,0,NaN,50,среднее,1,женат / замужем,0,F,госслужащий,0,NaN,сделка с подержанным автомобилем
55,0,NaN,54,среднее,1,гражданский брак,1,F,пенсионер,1,NaN,сыграть свадьбу
...,...,...,...,...,...,...,...,...,...,...,...,...
21489,2,NaN,47,среднее,1,женат / замужем,0,M,компаньон,0,NaN,сделка с автомобилем
21495,1,NaN,50,среднее,1,гражданский брак,1,F,сотрудник,0,NaN,свадьба
21497,0,NaN,48,высшее,0,женат / замужем,0,F,компаньон,0,NaN,строительство недвижимости
21502,1,NaN,42,среднее,1,женат / замужем,0,F,сотрудник,0,NaN,строительство жилой недвижимости
21510,2,NaN,28,среднее,1,женат / замужем,0,F,сотрудник,0,NaN,приобретение автомобиля

у тех, у кого nan в days_employed у них же nan в total_income.
пустые значения в total_income можно заполнить на медианное значение среди одинаковых типов занятости:

Проверяю находит ли медиану:

In [29]:
NaN_income_type=['госслужащий','компаньон','пенсионер','сотрудник', 'безработный']   
for q in NaN_income_type:
    median_data = data.sort_values(by='income_type')
    median_data = data.loc[data['income_type'] == q,'total_income'].median()
    print(median_data)

150420.15027571545
172517.41890715924
118480.8374078531
142587.58897640655
79079.30864901151

In [30]:
def FillNaNTotalIncome(param):
    median_data = data.sort_values(by='income_type')
    median_data = data.loc[data['income_type'] == param,'total_income'].median()
    data.loc[data['income_type'] == param, 'total_income'] = data.loc[data['income_type'] == param, 'total_income'].fillna(value=median_data)
    return data

In [31]:
NaN_income_type=['госслужащий','компаньон','пенсионер','сотрудник', 'безработный']   
for q in NaN_income_type:
    data = FillNaNTotalIncome(q)

In [32]:
data['total_income'].value_counts()

142587.588976    1102
172517.418907     505
118480.837408     411
150420.150276     147
100213.989206       1
                 ...
94866.149495        1
102584.459738       1
263541.296997       1
168463.737577       1
150014.128510       1
Name: total_income, Length: 19240, dtype: int64

In [33]:
data['total_income'].isna().sum()

0

In [34]:
data['purpose'].value_counts()

свадьба                                   796
на проведение свадьбы                     772
сыграть свадьбу                           769
операции с недвижимостью                  673
покупка коммерческой недвижимости         661
покупка жилья для сдачи                   651
операции с жильем                         648
операции с коммерческой недвижимостью     646
жилье                                     642
покупка жилья                             641
покупка жилья для семьи                   640
недвижимость                              632
строительство собственной недвижимости    628
операции со своей недвижимостью           626
строительство жилой недвижимости          622
строительство недвижимости                620
покупка своего жилья                      619
покупка недвижимости                      618
ремонт жилью                              609
покупка жилой недвижимости                603
на покупку своего автомобиля              504
заняться высшим образованием              496
автомобиль                                492
сделка с подержанным автомобилем          484
автомобили                                476
свой автомобиль                           475
на покупку подержанного автомобиля        472
на покупку автомобиля                     470
приобретение автомобиля                   460
дополнительное образование                457
сделка с автомобилем                      455
высшее образование                        447
получение дополнительного образования     445
образование                               442
получение образования                     441
профильное образование                    432
получение высшего образования             425
заняться образованием                     412
Name: purpose, dtype: int64

Пропусков нет, необходимо сгруппировать по одним тематикам. Этим займемся в разделе лемматизации.

Решаем не использовать 3 характеристики. 2 из которых коррелируются с похожими 2-мя. Одна не влияет на ответ.

In [35]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 21401 entries, 0 to 21524
Data columns (total 12 columns):
children            21401 non-null int64
days_employed       19239 non-null float64
dob_years           21401 non-null int64
education           21401 non-null object
education_id        21401 non-null int64
family_status       21401 non-null object
family_status_id    21401 non-null int64
gender              21401 non-null object
income_type         21401 non-null object
debt                21401 non-null int64
total_income        21401 non-null float64
purpose             21401 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.1+ MB

In [36]:
data_final = data[['children', 'dob_years', 
                   'education', 'family_status', 'gender', 'income_type', 'debt', 'total_income', 'purpose']]

Убираю два столбца, которые отражают одну инфорамацию.

In [37]:
data_final.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 21401 entries, 0 to 21524
Data columns (total 9 columns):
children         21401 non-null int64
dob_years        21401 non-null int64
education        21401 non-null object
family_status    21401 non-null object
gender           21401 non-null object
income_type      21401 non-null object
debt             21401 non-null int64
total_income     21401 non-null float64
purpose          21401 non-null object
dtypes: float64(1), int64(3), object(5)
memory usage: 1.6+ MB

### Вывод

Почти в каждую характеристику закрались какие то пропуски или неверные значения.
Нет смысла править каждую характеристику. Возможно, для выполнения задачи нет необходимости править все(допустим характеристики education, days_employed и family_status) Эти характеристики либо могут быть обозначены другими характеристиками(пары education и  education_id) или просто не нужны. 
Пропуск в total_income - случайные пропуски, так как у нас есть характерист
ика должности, которая может помочь заполнить эти пустые значения.
Пропуски в dob_years и children это неточность заполняющего оператора. Думаю это полностью случайные пропуски.
В возрасте думаю 0 появился из-за возрастов вида 20, 30, 40. Оператор забыл первое число.
С детьми думаю тоже ошибка оператора. -1 это 1, 20 это или 2, или 0.

### Замена типа данных

Необходимо заменить характеристику total_income из float в int

In [38]:
data_final['total_income'] = data_final['total_income'].astype('int')

/opt/conda/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [39]:
data_final.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 21401 entries, 0 to 21524
Data columns (total 9 columns):
children         21401 non-null int64
dob_years        21401 non-null int64
education        21401 non-null object
family_status    21401 non-null object
gender           21401 non-null object
income_type      21401 non-null object
debt             21401 non-null int64
total_income     21401 non-null int64
purpose          21401 non-null object
dtypes: int64(4), object(5)
memory usage: 1.6+ MB

In [40]:
data_final.head()

,children,dob_years,education,family_status,gender,income_type,debt,total_income,purpose
0,1,42,высшее,женат / замужем,F,сотрудник,0,253875,покупка жилья
1,1,36,среднее,женат / замужем,F,сотрудник,0,112080,приобретение автомобиля
2,0,33,среднее,женат / замужем,M,сотрудник,0,145885,покупка жилья
3,3,32,среднее,женат / замужем,M,сотрудник,0,267628,дополнительное образование
4,0,53,среднее,гражданский брак,F,пенсионер,0,158616,сыграть свадьбу

Меняем float на int в характеристике total_income, чтобы таблица обрабатывалась быстрее.

In [41]:
data_final.duplicated().sum()

72

In [42]:
data_final = data_final.drop_duplicates().reset_index(drop = True)

In [43]:
data_final.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21329 entries, 0 to 21328
Data columns (total 9 columns):
children         21329 non-null int64
dob_years        21329 non-null int64
education        21329 non-null object
family_status    21329 non-null object
gender           21329 non-null object
income_type      21329 non-null object
debt             21329 non-null int64
total_income     21329 non-null int64
purpose          21329 non-null object
dtypes: int64(4), object(5)
memory usage: 1.5+ MB

В таблице было 72 дубликата. Удаляем

In [44]:
def categorization(purpose):
    lemmas = m.lemmatize(purpose)
    lemma = ['жилье', 'автомобиль', 'свадьба', 'недвижимость', 'образование']
    for word in lemmas:
        if word in lemma:
            return word
#for row in data_final['purpose']:
#    lemmas = m.lemmatize(row)
#    print(lemmas)

In [45]:
data_final['purpose'] = data_final['purpose'].apply(categorization)

In [46]:
data_final['purpose'].value_counts()

недвижимость    6312
жилье           4437
автомобиль      4279
образование     3988
свадьба         2313
Name: purpose, dtype: int64

Первым делом мы обработали полные дубликаты и удалили их.

Вторым делом: с помощью лемматизации определяем основные 5 категорий, на которые стоит разделить характеристику purpose. 
Функция categorization помогает нам распределить всехклиентов по этим 5 категориям.

Первое.
Обнаружил, что цифровые значения в family_status_id и education_id неудобны, когда необходимо сводить таблицы. Вернусь и исправлю.

Второе.
В идеале возраст тоже нужно привести к категориям. Но задача кредитного отдела и проекта не требует этого значения.

In [47]:
def rich_or_not(total_income):
    if total_income < 50000:
        return 'до 50000'
    elif 50000 <= total_income < 100000:
        return 'от 50000 до 100000'
    elif 100000 <= total_income < 150000:
        return 'от 100000 до 150000'
    elif 150000 <= total_income < 200000:
        return 'от 150000 до 200000'
    elif 200000 <= total_income < 300000:
        return 'от 200000 до 300000'
    return 'от 300000'

In [48]:
data_final['total_income'] = data_final['total_income'].apply(rich_or_not)

Распределил людей по разным уровням заработка. Это нам поможет в будущем определить, при каком достатке люди чаще имеют проблемы с кредитами.

- Есть ли зависимость между наличием детей и возвратом кредита в срок?

In [49]:
data_final_pivot = data_final.pivot_table(index = 'children', values = 'debt', aggfunc = ['sum','count'])

In [50]:
data_final_pivot['ratio'] = data_final_pivot['sum'] / data_final_pivot['count']

In [51]:
data_final_pivot

           sum  count     ratio
          debt   debt
children
0         1063  14089  0.075449
1          444   4808  0.092346
2          194   2052  0.094542
3           27    330  0.081818
4            4     41  0.097561
5            0      9  0.000000

Люди с детьми чаще не возращают кредиты.

- Есть ли зависимость между семейным положением и возвратом кредита в срок?

In [52]:
data_final_pivot = data_final.pivot_table(index = 'family_status', values = 'debt', aggfunc = ['sum','count'])

In [53]:
data_final_pivot['ratio'] = data_final_pivot['sum'] / data_final_pivot['count']

In [54]:
data_final_pivot

                       sum  count     ratio
                      debt   debt
family_status
Не женат / не замужем  273   2796  0.097639
в разводе               84   1189  0.070648
вдовец / вдова          63    951  0.066246
гражданский брак       385   4133  0.093153
женат / замужем        927  12260  0.075612

Люди кто был или сейчас официально расписан реже сталкиваются с проблемой не отдачи кредитов.

- Есть ли зависимость между уровнем дохода и возвратом кредита в срок?

In [55]:
data_final_pivot = data_final.pivot_table(index = 'total_income', values = 'debt', aggfunc = ['sum','count'])
data_final_pivot['ratio'] = data_final_pivot['sum'] / data_final_pivot['count']
data_final_pivot

                     sum count     ratio
                    debt  debt
total_income
до 50000              23   371  0.061995
от 100000 до 150000  619  7109  0.087073
от 150000 до 200000  403  4739  0.085039
от 200000 до 300000  250  3564  0.070146
от 300000            106  1473  0.071962
от 50000 до 100000   331  4073  0.081267

Чаще всего не возращают кредиты люди с зарплатой от 100000 до 200000.

- Как разные цели кредита влияют на его возврат в срок?

In [56]:
data_final_pivot = data_final.pivot_table(index = 'purpose', values = 'debt', aggfunc = ['sum','count'])
data_final_pivot['ratio'] = data_final_pivot['sum'] / data_final_pivot['count']
data_final_pivot

              sum count     ratio
             debt  debt
purpose
автомобиль    400  4279  0.093480
жилье         308  4437  0.069416
недвижимость  472  6312  0.074778
образование   369  3988  0.092528
свадьба       183  2313  0.079118

Кредиты на автомобиль или образование чаще не отдаются.

В процессе работы, я посчитал, что раз характеристики (family_status и family_status_id) и (education и education_id) коррелируют, то можно выбрать более простой(над которым не нужно работать. Но в конце, стало понятно, что в таком виде информацию не преподать обычным людям. Для них категероии 0,1,2,3 ничего не говорят. Чтобы таблицы были читаемые необходимо или поработать с категориями изначально(убрать лишние, понизить регистр и.т.д.) или воспользоваться в начале простым вариантом, а вконце поменять численные значения категорий, на понятные.
<br></br>